<a href="https://colab.research.google.com/github/smileone22/20Fall_R-BASIC-learningforBigData/blob/master/11_Titanic_Data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

In [2]:
train = pd.read_csv('https://bit.ly/fc-ml-titanic')

In [3]:
train.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

- Kaggle.com - useful site for data source

In [4]:
# Preprocessing : splitting training/ validation set 
# 1. Define feature data, labels
# 2. Split training/ validation set 


feature = ['Pclass','Sex','Age','Fare']
label = ['Survived']

In [5]:
train[feature].head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [7]:
train[label].head()

   Survived
0         0
1         1
2         1
3         1
4         0

In [8]:
from sklearn.model_selection import train_test_split

* test_size: percentage for validation set 
* shuffle: shuffle option ( default to be true) 
* random_state: random seed value

In [10]:
x_train, x_valid, y_train, y_valid = train_test_split(train[feature],train[label], test_size=0.2, shuffle=True, random_state=10)

In [12]:
x_train.shape, y_train.shape

((712, 4), (712, 1))

In [13]:
x_valid.shape, y_valid.shape

((179, 4), (179, 1))